GopalSaraf/Practicals/PSDL/include/proc/pic16f18346.h
// CLC4POL<LC4G2POL>
extern volatile __bit                   LC4G2POL            __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 LC4G2POL_bit        _BIT_ACCESS(CLC4POL,1)
// CLC4GLS2<LC4G3D1N>
extern volatile __bit                   LC4G3D1N            __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 LC4G3D1N_bit        _BIT_ACCESS(CLC4GLS2,0)
// CLC4GLS2<LC4G3D1T>
extern volatile __bit                   LC4G3D1T            __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 LC4G3D1T_bit        _BIT_ACCESS(CLC4GLS2,1)
// CLC4GLS2<LC4G3D2N>
extern volatile __bit                   LC4G3D2N            __at(0x79B2);	// @ (0xF36 * 8 + 2)
#define                                 LC4G3D2N_bit        _BIT_ACCESS(CLC4GLS2,2)
// CLC4GLS2<LC4G3D2T>
extern volatile __bit                   LC4G3D2T            __at(0x79B3);	// @ (0xF36 * 8 + 3)
#define                                 LC4G3D2T_bit        _BIT_ACCESS(CLC4GLS2,3)
// CLC4GLS2<LC4G3D3N>
extern volatile __bit                   LC4G3D3N            __at(0x79B4);	// @ (0xF36 * 8 + 4)
#define                                 LC4G3D3N_bit        _BIT_ACCESS(CLC4GLS2,4)
// CLC4GLS2<LC4G3D3T>
extern volatile __bit                   LC4G3D3T            __at(0x79B5);	// @ (0xF36 * 8 + 5)
#define                                 LC4G3D3T_bit        _BIT_ACCESS(CLC4GLS2,5)
// CLC4GLS2<LC4G3D4N>
extern volatile __bit                   LC4G3D4N            __at(0x79B6);	// @ (0xF36 * 8 + 6)
#define                                 LC4G3D4N_bit        _BIT_ACCESS(CLC4GLS2,6)
// CLC4GLS2<LC4G3D4T>
extern volatile __bit                   LC4G3D4T            __at(0x79B7);	// @ (0xF36 * 8 + 7)
#define                                 LC4G3D4T_bit        _BIT_ACCESS(CLC4GLS2,7)
// CLC4POL<LC4G3POL>
extern volatile __bit                   LC4G3POL            __at(0x797A);	// @ (0xF2F * 8 + 2)
#define                                 LC4G3POL_bit        _BIT_ACCESS(CLC4POL,2)
// CLC4GLS3<LC4G4D1N>
extern volatile __bit                   LC4G4D1N            __at(0x79B8);	// @ (0xF37 * 8 + 0)
#define                                 LC4G4D1N_bit        _BIT_ACCESS(CLC4GLS3,0)
// CLC4GLS3<LC4G4D1T>
extern volatile __bit                   LC4G4D1T            __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 LC4G4D1T_bit        _BIT_ACCESS(CLC4GLS3,1)
// CLC4GLS3<LC4G4D2N>
extern volatile __bit                   LC4G4D2N            __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 LC4G4D2N_bit        _BIT_ACCESS(CLC4GLS3,2)
// CLC4GLS3<LC4G4D2T>
extern volatile __bit                   LC4G4D2T            __at(0x79BB);	// @ (0xF37 * 8 + 3)
#define                                 LC4G4D2T_bit        _BIT_ACCESS(CLC4GLS3,3)
// CLC4GLS3<LC4G4D3N>
extern volatile __bit                   LC4G4D3N            __at(0x79BC);	// @ (0xF37 * 8 + 4)
#define                                 LC4G4D3N_bit        _BIT_ACCESS(CLC4GLS3,4)
// CLC4GLS3<LC4G4D3T>
extern volatile __bit                   LC4G4D3T            __at(0x79BD);	// @ (0xF37 * 8 + 5)
#define                                 LC4G4D3T_bit        _BIT_ACCESS(CLC4GLS3,5)
// CLC4GLS3<LC4G4D4N>
extern volatile __bit                   LC4G4D4N            __at(0x79BE);	// @ (0xF37 * 8 + 6)
#define                                 LC4G4D4N_bit        _BIT_ACCESS(CLC4GLS3,6)
// CLC4GLS3<LC4G4D4T>
extern volatile __bit                   LC4G4D4T            __at(0x79BF);	// @ (0xF37 * 8 + 7)
#define                                 LC4G4D4T_bit        _BIT_ACCESS(CLC4GLS3,7)
// CLC4POL<LC4G4POL>
extern volatile __bit                   LC4G4POL            __at(0x797B);	// @ (0xF2F * 8 + 3)
#define                                 LC4G4POL_bit        _BIT_ACCESS(CLC4POL,3)
// CLC4CON<LC4INTN>
extern volatile __bit                   LC4INTN             __at(0x7973);	// @ (0xF2E * 8 + 3)
#define                                 LC4INTN_bit         _BIT_ACCESS(CLC4CON,3)
// CLC4CON<LC4INTP>
extern volatile __bit                   LC4INTP             __at(0x7974);	// @ (0xF2E * 8 + 4)
#define                                 LC4INTP_bit         _BIT_ACCESS(CLC4CON,4)
// CLC4CON<LC4MODE0>
extern volatile __bit                   LC4MODE0            __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 LC4MODE0_bit        _BIT_ACCESS(CLC4CON,0)
// CLC4CON<LC4MODE1>
extern volatile __bit                   LC4MODE1            __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 LC4MODE1_bit        _BIT_ACCESS(CLC4CON,1)
// CLC4CON<LC4MODE2>
extern volatile __bit                   LC4MODE2            __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 LC4MODE2_bit        _BIT_ACCESS(CLC4CON,2)
// CLC4CON<LC4OUT>
extern volatile __bit                   LC4OUT              __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 LC4OUT_bit          _BIT_ACCESS(CLC4CON,5)
// CLC4POL<LC4POL>
extern volatile __bit                   LC4POL              __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 LC4POL_bit          _BIT_ACCESS(CLC4POL,7)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x48EC);	// @ (0x91D * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT1<LFOR>
extern volatile __bit                   LFOR                __at(0x48E4);	// @ (0x91C * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT1,4)
// NVMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0x44AD);	// @ (0x895 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(NVMCON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// MDCON<MDBIT>
extern volatile __bit                   MDBIT               __at(0x1CE0);	// @ (0x39C * 8 + 0)
#define                                 MDBIT_bit           _BIT_ACCESS(MDCON,0)
// MDCARH<MDCH0>
extern volatile __bit                   MDCH0               __at(0x1CF0);	// @ (0x39E * 8 + 0)
#define                                 MDCH0_bit           _BIT_ACCESS(MDCARH,0)
// MDCARH<MDCH1>
extern volatile __bit                   MDCH1               __at(0x1CF1);	// @ (0x39E * 8 + 1)
#define                                 MDCH1_bit           _BIT_ACCESS(MDCARH,1)
// MDCARH<MDCH2>
extern volatile __bit                   MDCH2               __at(0x1CF2);	// @ (0x39E * 8 + 2)
#define                                 MDCH2_bit           _BIT_ACCESS(MDCARH,2)
// MDCARH<MDCH3>
extern volatile __bit                   MDCH3               __at(0x1CF3);	// @ (0x39E * 8 + 3)
#define                                 MDCH3_bit           _BIT_ACCESS(MDCARH,3)
// MDCARH<MDCHPOL>
extern volatile __bit                   MDCHPOL             __at(0x1CF6);	// @ (0x39E * 8 + 6)
#define                                 MDCHPOL_bit         _BIT_ACCESS(MDCARH,6)
// MDCARH<MDCHSYNC>
extern volatile __bit                   MDCHSYNC            __at(0x1CF5);	// @ (0x39E * 8 + 5)
#define                                 MDCHSYNC_bit        _BIT_ACCESS(MDCARH,5)
// MDCIN1PPS<MDCIN1PPS0>
extern volatile __bit                   MDCIN1PPS0          __at(0x70D0);	// @ (0xE1A * 8 + 0)
#define                                 MDCIN1PPS0_bit      _BIT_ACCESS(MDCIN1PPS,0)
// MDCIN1PPS<MDCIN1PPS1>
extern volatile __bit                   MDCIN1PPS1          __at(0x70D1);	// @ (0xE1A * 8 + 1)
#define                                 MDCIN1PPS1_bit      _BIT_ACCESS(MDCIN1PPS,1)
// MDCIN1PPS<MDCIN1PPS2>
extern volatile __bit                   MDCIN1PPS2          __at(0x70D2);	// @ (0xE1A * 8 + 2)
#define                                 MDCIN1PPS2_bit      _BIT_ACCESS(MDCIN1PPS,2)
// MDCIN1PPS<MDCIN1PPS3>
extern volatile __bit                   MDCIN1PPS3          __at(0x70D3);	// @ (0xE1A * 8 + 3)
#define                                 MDCIN1PPS3_bit      _BIT_ACCESS(MDCIN1PPS,3)
// MDCIN1PPS<MDCIN1PPS4>
extern volatile __bit                   MDCIN1PPS4          __at(0x70D4);	// @ (0xE1A * 8 + 4)
#define                                 MDCIN1PPS4_bit      _BIT_ACCESS(MDCIN1PPS,4)
// MDCIN2PPS<MDCIN2PPS0>
extern volatile __bit                   MDCIN2PPS0          __at(0x70D8);	// @ (0xE1B * 8 + 0)
#define                                 MDCIN2PPS0_bit      _BIT_ACCESS(MDCIN2PPS,0)
// MDCIN2PPS<MDCIN2PPS1>
extern volatile __bit                   MDCIN2PPS1          __at(0x70D9);	// @ (0xE1B * 8 + 1)
#define                                 MDCIN2PPS1_bit      _BIT_ACCESS(MDCIN2PPS,1)
// MDCIN2PPS<MDCIN2PPS2>
extern volatile __bit                   MDCIN2PPS2          __at(0x70DA);	// @ (0xE1B * 8 + 2)
#define                                 MDCIN2PPS2_bit      _BIT_ACCESS(MDCIN2PPS,2)
// MDCIN2PPS<MDCIN2PPS3>
extern volatile __bit                   MDCIN2PPS3          __at(0x70DB);	// @ (0xE1B * 8 + 3)
#define                                 MDCIN2PPS3_bit      _BIT_ACCESS(MDCIN2PPS,3)
// MDCIN2PPS<MDCIN2PPS4>
extern volatile __bit                   MDCIN2PPS4          __at(0x70DC);	// @ (0xE1B * 8 + 4)
#define                                 MDCIN2PPS4_bit      _BIT_ACCESS(MDCIN2PPS,4)
// MDCARL<MDCL0>
extern volatile __bit                   MDCL0               __at(0x1CF8);	// @ (0x39F * 8 + 0)
#define                                 MDCL0_bit           _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCL1>
extern volatile __bit                   MDCL1               __at(0x1CF9);	// @ (0x39F * 8 + 1)
#define                                 MDCL1_bit           _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCL2>
extern volatile __bit                   MDCL2               __at(0x1CFA);	// @ (0x39F * 8 + 2)
#define                                 MDCL2_bit           _BIT_ACCESS(MDCARL,2)
// MDCARL<MDCL3>
extern volatile __bit                   MDCL3               __at(0x1CFB);	// @ (0x39F * 8 + 3)
#define                                 MDCL3_bit           _BIT_ACCESS(MDCARL,3)
// MDCARL<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x1CFE);	// @ (0x39F * 8 + 6)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCARL,6)
// MDCARL<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x1CFD);	// @ (0x39F * 8 + 5)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCARL,5)
// MDCON<MDEN>
extern volatile __bit                   MDEN                __at(0x1CE7);	// @ (0x39C * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON,7)
// MDMINPPS<MDMINPPS0>
extern volatile __bit                   MDMINPPS0           __at(0x70E0);	// @ (0xE1C * 8 + 0)
#define                                 MDMINPPS0_bit       _BIT_ACCESS(MDMINPPS,0)
// MDMINPPS<MDMINPPS1>
extern volatile __bit                   MDMINPPS1           __at(0x70E1);	// @ (0xE1C * 8 + 1)
#define                                 MDMINPPS1_bit       _BIT_ACCESS(MDMINPPS,1)
// MDMINPPS<MDMINPPS2>
extern volatile __bit                   MDMINPPS2           __at(0x70E2);	// @ (0xE1C * 8 + 2)
#define                                 MDMINPPS2_bit       _BIT_ACCESS(MDMINPPS,2)
// MDMINPPS<MDMINPPS3>
extern volatile __bit                   MDMINPPS3           __at(0x70E3);	// @ (0xE1C * 8 + 3)
#define                                 MDMINPPS3_bit       _BIT_ACCESS(MDMINPPS,3)
// MDMINPPS<MDMINPPS4>
extern volatile __bit                   MDMINPPS4           __at(0x70E4);	// @ (0xE1C * 8 + 4)
#define                                 MDMINPPS4_bit       _BIT_ACCESS(MDMINPPS,4)
// MDSRC<MDMS0>
extern volatile __bit                   MDMS0               __at(0x1CE8);	// @ (0x39D * 8 + 0)
#define                                 MDMS0_bit           _BIT_ACCESS(MDSRC,0)
// MDSRC<MDMS1>
extern volatile __bit                   MDMS1               __at(0x1CE9);	// @ (0x39D * 8 + 1)
#define                                 MDMS1_bit           _BIT_ACCESS(MDSRC,1)
// MDSRC<MDMS2>
extern volatile __bit                   MDMS2               __at(0x1CEA);	// @ (0x39D * 8 + 2)
#define                                 MDMS2_bit           _BIT_ACCESS(MDSRC,2)
// MDSRC<MDMS3>
extern volatile __bit                   MDMS3               __at(0x1CEB);	// @ (0x39D * 8 + 3)
#define                                 MDMS3_bit           _BIT_ACCESS(MDSRC,3)
// MDCON<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x1CE4);	// @ (0x39C * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON,4)
// MDCON<MDOUT>
extern volatile __bit                   MDOUT               __at(0x1CE3);	// @ (0x39C * 8 + 3)
#define                                 MDOUT_bit           _BIT_ACCESS(MDCON,3)
// CLCDATA<MLC1OUT>
extern volatile __bit                   MLC1OUT             __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 MLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// CLCDATA<MLC2OUT>
extern volatile __bit                   MLC2OUT             __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 MLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// CLCDATA<MLC3OUT>
extern volatile __bit                   MLC3OUT             __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 MLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// PMD4<MSSP1MD>
extern volatile __bit                   MSSP1MD             __at(0x48A9);	// @ (0x915 * 8 + 1)
#define                                 MSSP1MD_bit         _BIT_ACCESS(PMD4,1)
// PMD4<MSSP2MD>
extern volatile __bit                   MSSP2MD             __at(0x48AA);	// @ (0x915 * 8 + 2)
#define                                 MSSP2MD_bit         _BIT_ACCESS(PMD4,2)
// NCO1CLK<N1CKS0>
extern volatile __bit                   N1CKS0              __at(0x24F8);	// @ (0x49F * 8 + 0)
#define                                 N1CKS0_bit          _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<N1CKS1>
extern volatile __bit                   N1CKS1              __at(0x24F9);	// @ (0x49F * 8 + 1)
#define                                 N1CKS1_bit          _BIT_ACCESS(NCO1CLK,1)
// NCO1CLK<N1CKS2>
extern volatile __bit                   N1CKS2              __at(0x24FA);	// @ (0x49F * 8 + 2)
#define                                 N1CKS2_bit          _BIT_ACCESS(NCO1CLK,2)
// NCO1CLK<N1CKS3>
extern volatile __bit                   N1CKS3              __at(0x24FB);	// @ (0x49F * 8 + 3)
#define                                 N1CKS3_bit          _BIT_ACCESS(NCO1CLK,3)
// NCO1CON<N1EN>
extern volatile __bit                   N1EN                __at(0x24F7);	// @ (0x49E * 8 + 7)
#define                                 N1EN_bit            _BIT_ACCESS(NCO1CON,7)
// NCO1CON<N1OUT>
extern volatile __bit                   N1OUT               __at(0x24F5);	// @ (0x49E * 8 + 5)
#define                                 N1OUT_bit           _BIT_ACCESS(NCO1CON,5)
// NCO1CON<N1PFM>
extern volatile __bit                   N1PFM               __at(0x24F0);	// @ (0x49E * 8 + 0)
#define                                 N1PFM_bit           _BIT_ACCESS(NCO1CON,0)
// NCO1CON<N1POL>
extern volatile __bit                   N1POL               __at(0x24F4);	// @ (0x49E * 8 + 4)
#define                                 N1POL_bit           _BIT_ACCESS(NCO1CON,4)
// NCO1CLK<N1PWS0>
extern volatile __bit                   N1PWS0              __at(0x24FD);	// @ (0x49F * 8 + 5)
#define                                 N1PWS0_bit          _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<N1PWS1>
extern volatile __bit                   N1PWS1              __at(0x24FE);	// @ (0x49F * 8 + 6)
#define                                 N1PWS1_bit          _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<N1PWS2>
extern volatile __bit                   N1PWS2              __at(0x24FF);	// @ (0x49F * 8 + 7)
#define                                 N1PWS2_bit          _BIT_ACCESS(NCO1CLK,7)
// NCO1ACCL<NCO1ACC0>
extern volatile __bit                   NCO1ACC0            __at(0x24C0);	// @ (0x498 * 8 + 0)
#define                                 NCO1ACC0_bit        _BIT_ACCESS(NCO1ACCL,0)
// NCO1ACCL<NCO1ACC1>
extern volatile __bit                   NCO1ACC1            __at(0x24C1);	// @ (0x498 * 8 + 1)
#define                                 NCO1ACC1_bit        _BIT_ACCESS(NCO1ACCL,1)
// NCO1ACCH<NCO1ACC10>
extern volatile __bit                   NCO1ACC10           __at(0x24CA);	// @ (0x499 * 8 + 2)
#define                                 NCO1ACC10_bit       _BIT_ACCESS(NCO1ACCH,2)
// NCO1ACCH<NCO1ACC11>
extern volatile __bit                   NCO1ACC11           __at(0x24CB);	// @ (0x499 * 8 + 3)
#define                                 NCO1ACC11_bit       _BIT_ACCESS(NCO1ACCH,3)
// NCO1ACCH<NCO1ACC12>
extern volatile __bit                   NCO1ACC12           __at(0x24CC);	// @ (0x499 * 8 + 4)
#define                                 NCO1ACC12_bit       _BIT_ACCESS(NCO1ACCH,4)
// NCO1ACCH<NCO1ACC13>
extern volatile __bit                   NCO1ACC13           __at(0x24CD);	// @ (0x499 * 8 + 5)
#define                                 NCO1ACC13_bit       _BIT_ACCESS(NCO1ACCH,5)
// NCO1ACCH<NCO1ACC14>
extern volatile __bit                   NCO1ACC14           __at(0x24CE);	// @ (0x499 * 8 + 6)
#define                                 NCO1ACC14_bit       _BIT_ACCESS(NCO1ACCH,6)
// NCO1ACCH<NCO1ACC15>
extern volatile __bit                   NCO1ACC15           __at(0x24CF);	// @ (0x499 * 8 + 7)
#define                                 NCO1ACC15_bit       _BIT_ACCESS(NCO1ACCH,7)
// NCO1ACCU<NCO1ACC16>
extern volatile __bit                   NCO1ACC16           __at(0x24D0);	// @ (0x49A * 8 + 0)
#define                                 NCO1ACC16_bit       _BIT_ACCESS(NCO1ACCU,0)
// NCO1ACCU<NCO1ACC17>
extern volatile __bit                   NCO1ACC17           __at(0x24D1);	// @ (0x49A * 8 + 1)
#define                                 NCO1ACC17_bit       _BIT_ACCESS(NCO1ACCU,1)
// NCO1ACCU<NCO1ACC18>
extern volatile __bit                   NCO1ACC18           __at(0x24D2);	// @ (0x49A * 8 + 2)
#define                                 NCO1ACC18_bit       _BIT_ACCESS(NCO1ACCU,2)
// NCO1ACCU<NCO1ACC19>
extern volatile __bit                   NCO1ACC19           __at(0x24D3);	// @ (0x49A * 8 + 3)
#define                                 NCO1ACC19_bit       _BIT_ACCESS(NCO1ACCU,3)
// NCO1ACCL<NCO1ACC2>
extern volatile __bit                   NCO1ACC2            __at(0x24C2);	// @ (0x498 * 8 + 2)
#define                                 NCO1ACC2_bit        _BIT_ACCESS(NCO1ACCL,2)
// NCO1ACCU<NCO1ACC20>
extern volatile __bit                   NCO1ACC20           __at(0x24D4);	// @ (0x49A * 8 + 4)
#define                                 NCO1ACC20_bit       _BIT_ACCESS(NCO1ACCU,4)
// NCO1ACCU<NCO1ACC21>
extern volatile __bit                   NCO1ACC21           __at(0x24D5);	// @ (0x49A * 8 + 5)
#define                                 NCO1ACC21_bit       _BIT_ACCESS(NCO1ACCU,5)
// NCO1ACCU<NCO1ACC22>
extern volatile __bit                   NCO1ACC22           __at(0x24D6);	// @ (0x49A * 8 + 6)
#define                                 NCO1ACC22_bit       _BIT_ACCESS(NCO1ACCU,6)
// NCO1ACCU<NCO1ACC23>
extern volatile __bit                   NCO1ACC23           __at(0x24D7);	// @ (0x49A * 8 + 7)
#define                                 NCO1ACC23_bit       _BIT_ACCESS(NCO1ACCU,7)
// NCO1ACCL<NCO1ACC3>
extern volatile __bit                   NCO1ACC3            __at(0x24C3);	// @ (0x498 * 8 + 3)
#define                                 NCO1ACC3_bit        _BIT_ACCESS(NCO1ACCL,3)
// NCO1ACCL<NCO1ACC4>
extern volatile __bit                   NCO1ACC4            __at(0x24C4);	// @ (0x498 * 8 + 4)
#define                                 NCO1ACC4_bit        _BIT_ACCESS(NCO1ACCL,4)
// NCO1ACCL<NCO1ACC5>
extern volatile __bit                   NCO1ACC5            __at(0x24C5);	// @ (0x498 * 8 + 5)
#define                                 NCO1ACC5_bit        _BIT_ACCESS(NCO1ACCL,5)
// NCO1ACCL<NCO1ACC6>
extern volatile __bit                   NCO1ACC6            __at(0x24C6);	// @ (0x498 * 8 + 6)
#define                                 NCO1ACC6_bit        _BIT_ACCESS(NCO1ACCL,6)
// NCO1ACCL<NCO1ACC7>
extern volatile __bit                   NCO1ACC7            __at(0x24C7);	// @ (0x498 * 8 + 7)
#define                                 NCO1ACC7_bit        _BIT_ACCESS(NCO1ACCL,7)
// NCO1ACCH<NCO1ACC8>
extern volatile __bit                   NCO1ACC8            __at(0x24C8);	// @ (0x499 * 8 + 0)
#define                                 NCO1ACC8_bit        _BIT_ACCESS(NCO1ACCH,0)
// NCO1ACCH<NCO1ACC9>
extern volatile __bit                   NCO1ACC9            __at(0x24C9);	// @ (0x499 * 8 + 1)
#define                                 NCO1ACC9_bit        _BIT_ACCESS(NCO1ACCH,1)
// PIE2<NCO1IE>
extern volatile __bit                   NCO1IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 NCO1IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<NCO1IF>
extern volatile __bit                   NCO1IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 NCO1IF_bit          _BIT_ACCESS(PIR2,0)
// NCO1INCL<NCO1INC0>
extern volatile __bit                   NCO1INC0            __at(0x24D8);	// @ (0x49B * 8 + 0)
#define                                 NCO1INC0_bit        _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<NCO1INC1>
extern volatile __bit                   NCO1INC1            __at(0x24D9);	// @ (0x49B * 8 + 1)
#define                                 NCO1INC1_bit        _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<NCO1INC10>
extern volatile __bit                   NCO1INC10           __at(0x24E2);	// @ (0x49C * 8 + 2)
#define                                 NCO1INC10_bit       _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<NCO1INC11>
extern volatile __bit                   NCO1INC11           __at(0x24E3);	// @ (0x49C * 8 + 3)
#define                                 NCO1INC11_bit       _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<NCO1INC12>
extern volatile __bit                   NCO1INC12           __at(0x24E4);	// @ (0x49C * 8 + 4)
#define                                 NCO1INC12_bit       _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<NCO1INC13>
extern volatile __bit                   NCO1INC13           __at(0x24E5);	// @ (0x49C * 8 + 5)
#define                                 NCO1INC13_bit       _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<NCO1INC14>
extern volatile __bit                   NCO1INC14           __at(0x24E6);	// @ (0x49C * 8 + 6)
#define                                 NCO1INC14_bit       _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<NCO1INC15>
extern volatile __bit                   NCO1INC15           __at(0x24E7);	// @ (0x49C * 8 + 7)
#define                                 NCO1INC15_bit       _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<NCO1INC16>
extern volatile __bit                   NCO1INC16           __at(0x24E8);	// @ (0x49D * 8 + 0)
#define                                 NCO1INC16_bit       _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<NCO1INC17>
extern volatile __bit                   NCO1INC17           __at(0x24E9);	// @ (0x49D * 8 + 1)
#define                                 NCO1INC17_bit       _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<NCO1INC18>
extern volatile __bit                   NCO1INC18           __at(0x24EA);	// @ (0x49D * 8 + 2)
#define                                 NCO1INC18_bit       _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<NCO1INC19>
extern volatile __bit                   NCO1INC19           __at(0x24EB);	// @ (0x49D * 8 + 3)
