GopalSaraf/Practicals/PSDL/include/proc/pic16f18346.h
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xE6);	// @ (0x1C * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GPPS<T1GPPS0>
extern volatile __bit                   T1GPPS0             __at(0x7098);	// @ (0xE13 * 8 + 0)
#define                                 T1GPPS0_bit         _BIT_ACCESS(T1GPPS,0)
// T1GPPS<T1GPPS1>
extern volatile __bit                   T1GPPS1             __at(0x7099);	// @ (0xE13 * 8 + 1)
#define                                 T1GPPS1_bit         _BIT_ACCESS(T1GPPS,1)
// T1GPPS<T1GPPS2>
extern volatile __bit                   T1GPPS2             __at(0x709A);	// @ (0xE13 * 8 + 2)
#define                                 T1GPPS2_bit         _BIT_ACCESS(T1GPPS,2)
// T1GPPS<T1GPPS3>
extern volatile __bit                   T1GPPS3             __at(0x709B);	// @ (0xE13 * 8 + 3)
#define                                 T1GPPS3_bit         _BIT_ACCESS(T1GPPS,3)
// T1GPPS<T1GPPS4>
extern volatile __bit                   T1GPPS4             __at(0x709C);	// @ (0xE13 * 8 + 4)
#define                                 T1GPPS4_bit         _BIT_ACCESS(T1GPPS,4)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0xE4);	// @ (0x1C * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0xE1);	// @ (0x1C * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0xE5);	// @ (0x1C * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0xE2);	// @ (0x1C * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T1CON<T1SOSC>
extern volatile __bit                   T1SOSC              __at(0xDB);	// @ (0x1B * 8 + 3)
#define                                 T1SOSC_bit          _BIT_ACCESS(T1CON,3)
// T1CON<T1SYNC>
extern volatile __bit                   T1SYNC              __at(0xDA);	// @ (0x1B * 8 + 2)
#define                                 T1SYNC_bit          _BIT_ACCESS(T1CON,2)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,0)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,3)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,4)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0xFD);	// @ (0x1F * 8 + 5)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,5)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0xFE);	// @ (0x1F * 8 + 6)
#define                                 T2OUTPS3_bit        _BIT_ACCESS(T2CON,6)
// T3CON<T3CKPS0>
extern volatile __bit                   T3CKPS0             __at(0x209C);	// @ (0x413 * 8 + 4)
#define                                 T3CKPS0_bit         _BIT_ACCESS(T3CON,4)
// T3CON<T3CKPS1>
extern volatile __bit                   T3CKPS1             __at(0x209D);	// @ (0x413 * 8 + 5)
#define                                 T3CKPS1_bit         _BIT_ACCESS(T3CON,5)
// T3GCON<T3GGO_nDONE>
extern volatile __bit                   T3GGO_nDONE         __at(0x20A3);	// @ (0x414 * 8 + 3)
#define                                 T3GGO_nDONE_bit     _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GPOL>
extern volatile __bit                   T3GPOL              __at(0x20A6);	// @ (0x414 * 8 + 6)
#define                                 T3GPOL_bit          _BIT_ACCESS(T3GCON,6)
// T3GCON<T3GSPM>
extern volatile __bit                   T3GSPM              __at(0x20A4);	// @ (0x414 * 8 + 4)
#define                                 T3GSPM_bit          _BIT_ACCESS(T3GCON,4)
// T3GCON<T3GSS0>
extern volatile __bit                   T3GSS0              __at(0x20A0);	// @ (0x414 * 8 + 0)
#define                                 T3GSS0_bit          _BIT_ACCESS(T3GCON,0)
// T3GCON<T3GSS1>
extern volatile __bit                   T3GSS1              __at(0x20A1);	// @ (0x414 * 8 + 1)
#define                                 T3GSS1_bit          _BIT_ACCESS(T3GCON,1)
// T3GCON<T3GTM>
extern volatile __bit                   T3GTM               __at(0x20A5);	// @ (0x414 * 8 + 5)
#define                                 T3GTM_bit           _BIT_ACCESS(T3GCON,5)
// T3GCON<T3GVAL>
extern volatile __bit                   T3GVAL              __at(0x20A2);	// @ (0x414 * 8 + 2)
#define                                 T3GVAL_bit          _BIT_ACCESS(T3GCON,2)
// T3CON<T3SOSC>
extern volatile __bit                   T3SOSC              __at(0x209B);	// @ (0x413 * 8 + 3)
#define                                 T3SOSC_bit          _BIT_ACCESS(T3CON,3)
// T3CON<T3SYNC>
extern volatile __bit                   T3SYNC              __at(0x209A);	// @ (0x413 * 8 + 2)
#define                                 T3SYNC_bit          _BIT_ACCESS(T3CON,2)
// T4CON<T4CKPS0>
extern volatile __bit                   T4CKPS0             __at(0x20B8);	// @ (0x417 * 8 + 0)
#define                                 T4CKPS0_bit         _BIT_ACCESS(T4CON,0)
// T4CON<T4CKPS1>
extern volatile __bit                   T4CKPS1             __at(0x20B9);	// @ (0x417 * 8 + 1)
#define                                 T4CKPS1_bit         _BIT_ACCESS(T4CON,1)
// T4CON<T4OUTPS0>
extern volatile __bit                   T4OUTPS0            __at(0x20BB);	// @ (0x417 * 8 + 3)
#define                                 T4OUTPS0_bit        _BIT_ACCESS(T4CON,3)
// T4CON<T4OUTPS1>
extern volatile __bit                   T4OUTPS1            __at(0x20BC);	// @ (0x417 * 8 + 4)
#define                                 T4OUTPS1_bit        _BIT_ACCESS(T4CON,4)
// T4CON<T4OUTPS2>
extern volatile __bit                   T4OUTPS2            __at(0x20BD);	// @ (0x417 * 8 + 5)
#define                                 T4OUTPS2_bit        _BIT_ACCESS(T4CON,5)
// T4CON<T4OUTPS3>
extern volatile __bit                   T4OUTPS3            __at(0x20BE);	// @ (0x417 * 8 + 6)
#define                                 T4OUTPS3_bit        _BIT_ACCESS(T4CON,6)
// T5CON<T5CKPS0>
extern volatile __bit                   T5CKPS0             __at(0x20D4);	// @ (0x41A * 8 + 4)
#define                                 T5CKPS0_bit         _BIT_ACCESS(T5CON,4)
// T5CON<T5CKPS1>
extern volatile __bit                   T5CKPS1             __at(0x20D5);	// @ (0x41A * 8 + 5)
#define                                 T5CKPS1_bit         _BIT_ACCESS(T5CON,5)
// T5GCON<T5GGO_nDONE>
extern volatile __bit                   T5GGO_nDONE         __at(0x20DB);	// @ (0x41B * 8 + 3)
#define                                 T5GGO_nDONE_bit     _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GPOL>
extern volatile __bit                   T5GPOL              __at(0x20DE);	// @ (0x41B * 8 + 6)
#define                                 T5GPOL_bit          _BIT_ACCESS(T5GCON,6)
// T5GCON<T5GSPM>
extern volatile __bit                   T5GSPM              __at(0x20DC);	// @ (0x41B * 8 + 4)
#define                                 T5GSPM_bit          _BIT_ACCESS(T5GCON,4)
// T5GCON<T5GSS0>
extern volatile __bit                   T5GSS0              __at(0x20D8);	// @ (0x41B * 8 + 0)
#define                                 T5GSS0_bit          _BIT_ACCESS(T5GCON,0)
// T5GCON<T5GSS1>
extern volatile __bit                   T5GSS1              __at(0x20D9);	// @ (0x41B * 8 + 1)
#define                                 T5GSS1_bit          _BIT_ACCESS(T5GCON,1)
// T5GCON<T5GTM>
extern volatile __bit                   T5GTM               __at(0x20DD);	// @ (0x41B * 8 + 5)
#define                                 T5GTM_bit           _BIT_ACCESS(T5GCON,5)
// T5GCON<T5GVAL>
extern volatile __bit                   T5GVAL              __at(0x20DA);	// @ (0x41B * 8 + 2)
#define                                 T5GVAL_bit          _BIT_ACCESS(T5GCON,2)
// T5CON<T5SOSC>
extern volatile __bit                   T5SOSC              __at(0x20D3);	// @ (0x41A * 8 + 3)
#define                                 T5SOSC_bit          _BIT_ACCESS(T5CON,3)
// T5CON<T5SYNC>
extern volatile __bit                   T5SYNC              __at(0x20D2);	// @ (0x41A * 8 + 2)
#define                                 T5SYNC_bit          _BIT_ACCESS(T5CON,2)
// T6CON<T6CKPS0>
extern volatile __bit                   T6CKPS0             __at(0x20F0);	// @ (0x41E * 8 + 0)
#define                                 T6CKPS0_bit         _BIT_ACCESS(T6CON,0)
// T6CON<T6CKPS1>
extern volatile __bit                   T6CKPS1             __at(0x20F1);	// @ (0x41E * 8 + 1)
#define                                 T6CKPS1_bit         _BIT_ACCESS(T6CON,1)
// T6CON<T6OUTPS0>
extern volatile __bit                   T6OUTPS0            __at(0x20F3);	// @ (0x41E * 8 + 3)
#define                                 T6OUTPS0_bit        _BIT_ACCESS(T6CON,3)
// T6CON<T6OUTPS1>
extern volatile __bit                   T6OUTPS1            __at(0x20F4);	// @ (0x41E * 8 + 4)
#define                                 T6OUTPS1_bit        _BIT_ACCESS(T6CON,4)
// T6CON<T6OUTPS2>
extern volatile __bit                   T6OUTPS2            __at(0x20F5);	// @ (0x41E * 8 + 5)
#define                                 T6OUTPS2_bit        _BIT_ACCESS(T6CON,5)
// T6CON<T6OUTPS3>
extern volatile __bit                   T6OUTPS3            __at(0x20F6);	// @ (0x41E * 8 + 6)
#define                                 T6OUTPS3_bit        _BIT_ACCESS(T6CON,6)
// TMR0L<TMR00>
extern volatile __bit                   TMR00               __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 TMR00_bit           _BIT_ACCESS(TMR0L,0)
// TMR0L<TMR01>
extern volatile __bit                   TMR01               __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 TMR01_bit           _BIT_ACCESS(TMR0L,1)
// TMR0H<TMR010>
extern volatile __bit                   TMR010              __at(0xB2);	// @ (0x16 * 8 + 2)
#define                                 TMR010_bit          _BIT_ACCESS(TMR0H,2)
// TMR0H<TMR011>
extern volatile __bit                   TMR011              __at(0xB3);	// @ (0x16 * 8 + 3)
#define                                 TMR011_bit          _BIT_ACCESS(TMR0H,3)
// TMR0H<TMR012>
extern volatile __bit                   TMR012              __at(0xB4);	// @ (0x16 * 8 + 4)
#define                                 TMR012_bit          _BIT_ACCESS(TMR0H,4)
// TMR0H<TMR013>
extern volatile __bit                   TMR013              __at(0xB5);	// @ (0x16 * 8 + 5)
#define                                 TMR013_bit          _BIT_ACCESS(TMR0H,5)
// TMR0H<TMR014>
extern volatile __bit                   TMR014              __at(0xB6);	// @ (0x16 * 8 + 6)
#define                                 TMR014_bit          _BIT_ACCESS(TMR0H,6)
// TMR0H<TMR015>
extern volatile __bit                   TMR015              __at(0xB7);	// @ (0x16 * 8 + 7)
#define                                 TMR015_bit          _BIT_ACCESS(TMR0H,7)
// TMR0L<TMR02>
extern volatile __bit                   TMR02               __at(0xAA);	// @ (0x15 * 8 + 2)
#define                                 TMR02_bit           _BIT_ACCESS(TMR0L,2)
// TMR0L<TMR03>
extern volatile __bit                   TMR03               __at(0xAB);	// @ (0x15 * 8 + 3)
#define                                 TMR03_bit           _BIT_ACCESS(TMR0L,3)
// TMR0L<TMR04>
extern volatile __bit                   TMR04               __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 TMR04_bit           _BIT_ACCESS(TMR0L,4)
// TMR0L<TMR05>
extern volatile __bit                   TMR05               __at(0xAD);	// @ (0x15 * 8 + 5)
#define                                 TMR05_bit           _BIT_ACCESS(TMR0L,5)
// TMR0L<TMR06>
extern volatile __bit                   TMR06               __at(0xAE);	// @ (0x15 * 8 + 6)
#define                                 TMR06_bit           _BIT_ACCESS(TMR0L,6)
// TMR0L<TMR07>
extern volatile __bit                   TMR07               __at(0xAF);	// @ (0x15 * 8 + 7)
#define                                 TMR07_bit           _BIT_ACCESS(TMR0L,7)
// TMR0H<TMR08>
extern volatile __bit                   TMR08               __at(0xB0);	// @ (0x16 * 8 + 0)
#define                                 TMR08_bit           _BIT_ACCESS(TMR0H,0)
// TMR0H<TMR09>
extern volatile __bit                   TMR09               __at(0xB1);	// @ (0x16 * 8 + 1)
#define                                 TMR09_bit           _BIT_ACCESS(TMR0H,1)
// PIE0<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 TMR0IE_bit          _BIT_ACCESS(PIE0,5)
// PIR0<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 TMR0IF_bit          _BIT_ACCESS(PIR0,5)
// PMD1<TMR0MD>
extern volatile __bit                   TMR0MD              __at(0x4890);	// @ (0x912 * 8 + 0)
#define                                 TMR0MD_bit          _BIT_ACCESS(PMD1,0)
// T1CON<TMR1CS0>
extern volatile __bit                   TMR1CS0             __at(0xDE);	// @ (0x1B * 8 + 6)
#define                                 TMR1CS0_bit         _BIT_ACCESS(T1CON,6)
// T1CON<TMR1CS1>
extern volatile __bit                   TMR1CS1             __at(0xDF);	// @ (0x1B * 8 + 7)
#define                                 TMR1CS1_bit         _BIT_ACCESS(T1CON,7)
// T1GCON<TMR1GE>
extern volatile __bit                   TMR1GE              __at(0xE7);	// @ (0x1C * 8 + 7)
#define                                 TMR1GE_bit          _BIT_ACCESS(T1GCON,7)
// PIE1<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE1,7)
// PIR1<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x8F);	// @ (0x11 * 8 + 7)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR1,7)
// PIE1<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x88);	// @ (0x11 * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR1,0)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x4891);	// @ (0x912 * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0xD8);	// @ (0x1B * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE1<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE1,1)
// PIR1<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x89);	// @ (0x11 * 8 + 1)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR1,1)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x4892);	// @ (0x912 * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,2)
// T3CON<TMR3CS0>
extern volatile __bit                   TMR3CS0             __at(0x209E);	// @ (0x413 * 8 + 6)
#define                                 TMR3CS0_bit         _BIT_ACCESS(T3CON,6)
// T3CON<TMR3CS1>
extern volatile __bit                   TMR3CS1             __at(0x209F);	// @ (0x413 * 8 + 7)
#define                                 TMR3CS1_bit         _BIT_ACCESS(T3CON,7)
// T3GCON<TMR3GE>
extern volatile __bit                   TMR3GE              __at(0x20A7);	// @ (0x414 * 8 + 7)
#define                                 TMR3GE_bit          _BIT_ACCESS(T3GCON,7)
// PIE3<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE3,5)
// PIR3<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR3,5)
// PIE3<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x49C);	// @ (0x93 * 8 + 4)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x9C);	// @ (0x13 * 8 + 4)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR3,4)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x4893);	// @ (0x912 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x2098);	// @ (0x413 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE2<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x491);	// @ (0x92 * 8 + 1)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE2,1)
// PIR2<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x91);	// @ (0x12 * 8 + 1)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR2,1)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x4894);	// @ (0x912 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x20BA);	// @ (0x417 * 8 + 2)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,2)
// T5CON<TMR5CS0>
extern volatile __bit                   TMR5CS0             __at(0x20D6);	// @ (0x41A * 8 + 6)
#define                                 TMR5CS0_bit         _BIT_ACCESS(T5CON,6)
// T5CON<TMR5CS1>
extern volatile __bit                   TMR5CS1             __at(0x20D7);	// @ (0x41A * 8 + 7)
#define                                 TMR5CS1_bit         _BIT_ACCESS(T5CON,7)
// T5GCON<TMR5GE>
extern volatile __bit                   TMR5GE              __at(0x20DF);	// @ (0x41B * 8 + 7)
#define                                 TMR5GE_bit          _BIT_ACCESS(T5GCON,7)
// PIE4<TMR5GIE>
extern volatile __bit                   TMR5GIE             __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 TMR5GIE_bit         _BIT_ACCESS(PIE4,5)
// PIR4<TMR5GIF>
extern volatile __bit                   TMR5GIF             __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 TMR5GIF_bit         _BIT_ACCESS(PIR4,5)
// PIE4<TMR5IE>
extern volatile __bit                   TMR5IE              __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 TMR5IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<TMR5IF>
extern volatile __bit                   TMR5IF              __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 TMR5IF_bit          _BIT_ACCESS(PIR4,4)
// PMD1<TMR5MD>
extern volatile __bit                   TMR5MD              __at(0x4895);	// @ (0x912 * 8 + 5)
#define                                 TMR5MD_bit          _BIT_ACCESS(PMD1,5)
// T5CON<TMR5ON>
extern volatile __bit                   TMR5ON              __at(0x20D0);	// @ (0x41A * 8 + 0)
#define                                 TMR5ON_bit          _BIT_ACCESS(T5CON,0)
// PIE2<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR2,7)
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x4896);	// @ (0x912 * 8 + 6)
#define                                 TMR6MD_bit          _BIT_ACCESS(PMD1,6)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x20F2);	// @ (0x41E * 8 + 2)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,2)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x461);	// @ (0x8C * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x464);	// @ (0x8C * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x46C);	// @ (0x8D * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x46E);	// @ (0x8D * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x46F);	// @ (0x8D * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x471);	// @ (0x8E * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x472);	// @ (0x8E * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x473);	// @ (0x8E * 8 + 3)
